import random

def funny_name_generator_male():
    adjectives = [
        "Смешной", "Весёлый", "Шумный", "Бешеный", "Непоседливый", "Забавный",
        "Живой", "Шустрый", "Сонный", "Бодрый", "Виляющий", "Прыгучий"
    ]

    animals = [
        "Крокодил", "Заяц", "Лис", "Бобёр", "Барсук", "Медведь",
        "Волк", "Енот", "Слон", "Кенгуру", "Пеликан", "Бурундук",
        "Ёжик", "Пингвин", "Леопард"
    ]

    while True:
        yield f"{random.choice(adjectives)} {random.choice(animals)}"


def funny_name_generator_female():
    adjectives_female = [
        "Смешная", "Весёлая", "Шумная", "Бешеная", "Непоседливая", "Забавная",
        "Живая", "Шустрая", "Сонная", "Бодрая", "Виляющая", "Прыгучая"
    ]

    animals_female = [
        "Лиса", "Сова", "Антилопа", "Зебра", "Лягушка", "Панда", 
        "Черепаха", "Кошка", "Пума", "Ласточка", "Выдра",
        "Акула", "Зайчиха", "Медведица", "Волчица"
    ]

    while True:
        yield f"{random.choice(adjectives_female)} {random.choice(animals_female)}"
